Revit 2027 API
BrowserOrganization.AreFiltersSatisfied Method
 Determines if the given element satisfies the filters defined by the browser organization.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreFiltersSatisfied(
	ElementId elementId
)
Public Function AreFiltersSatisfied (
	elementId As ElementId
) As Boolean
public:
bool AreFiltersSatisfied(
	ElementId^ elementId
)
member AreFiltersSatisfied :
        elementId : ElementId -> bool
Parameters
elementId ElementId
 The element to check.
Return Value
Boolean
 True if the given element satisfies the filter.
Exceptions
Exception | Condition
ArgumentException |  elementId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BrowserOrganization Class
Autodesk.Revit.DB Namespace